#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 1463                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: flyingdisc1 <boj.kr/u/flyingdisc1>          +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/1463                           #+#        #+#      #+#     #
#    Solved: 2025/10/24 14:22:23 by flyingdisc1   ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #
import sys
input = sys.stdin.readline

n = int(input())
dp = [0] * (n + 1)
for i in range(2, n+1):
    # n <= 1이면 0
    # 2, 3으로 나눌 수 있어도 일단 1을 빼고 그 다음에 수행하는 것이 나은 경우 존재
    dp[i] = dp[i-1] + 1
    # 나눌 수 있을 때, 1을 빼고 수행하거나 바로 나누는 경우의 최솟값
    if i%2 == 0:
        dp[i] = min(dp[i], dp[i//2] + 1)
    if i%3 == 0:
        dp[i] = min(dp[i], dp[i//3] + 1)
print(dp[n])